# DockablePaneState Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePaneState Constructor
DockablePaneState Class See Also
---
Creates a new DockablePaneState object.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public DockablePaneState()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DockablePaneState()
```

# See Also
DockablePaneState Class
DockablePaneState Overload
Autodesk.Revit.UI Namespace